First Routes and Controllers/first_routes_and_controllers/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'Alex'"], ["email", "'alex@gmail.com'"], ["created_at", "2022-06-29 20:08:13.084894"], ["updated_at", "2022-06-29 20:08:13.084894"]]

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "'Melisa'"], ["email", "'melissa@gmail.com'"], ["updated_at", "2022-06-29 20:27:00.882388"], ["id", 2]]

    def destroy
        user = User.find(params[:id])
        user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]