art_share_api/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "'icdni'"], ["image_url", "iuwbihjbndwi"], ["artist_id", 1]]
---
    def create
        artwork = Artwork.new(artwork_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
SELECT "artworks".* FROM "artworks"
---
    def destroy
        artwork = Artwork.find(params[:id])
        artwork.delete
        render json: Artwork.all