art_share_api/app/controllers/comments_controller.rb

    def index
        if params[:comment][:commenter_id]
            commenter = User.find(params[:comment][:commenter_id])
            render json: commenter.comments
        elsif params[:comment][:artwork_id]
            artwork = Artwork.find(params[:comment][:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]