art_share_api/app/controllers/users_controller.rb

    def index
        if params[:query]
            user = User
                .select('*')
                .where("username LIKE '%#{params[:query]}%'")

            render json: user
        else
            render json: User.all
---
SELECT * FROM "users" WHERE (username LIKE '%('Leonardo')%')

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "'oksn'"], ["created_at", "2022-06-29 21:17:12.163654"], ["updated_at", "2022-06-29 21:17:12.163654"]]

    def destroy
        user = User.find(params[:id])
        user.delete
        render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users"